# ------------------------------------------------------------------------------
# Brewfile - Homebrew packages for macOS and Linux
# ------------------------------------------------------------------------------
# Usage: brew bundle --file=Brewfile
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# Shell and prompt
brew "zsh"
brew "sheldon"    # zsh plugin manager
brew "starship"

# Git
brew "git"
brew "gh"

# Modern CLI replacements
brew "eza"          # ls replacement
brew "bat"          # cat replacement
brew "fzf"          # fuzzy finder
brew "ripgrep"      # grep replacement
brew "zoxide"       # cd replacement
brew "tmux"         # terminal multiplexer
brew "zellij"       # terminal multiplexer

# Development tools
brew "direnv"
brew "shellcheck"
brew "pre-commit"
brew "just"          # task runner
brew "prek"          # pre-commit hooks

# Cloud credentials
brew "aws-vault"
tap "jacobbednarz/tap"
brew "jacobbednarz/tap/cf-vault"

# Runtime managers
brew "mise"       # Node.js, etc.
brew "uv"         # Python

# Utilities
brew "curl"
brew "wget"
brew "jq"
brew "tailscale"
brew "tree"
brew "gnupg"
brew "xsel" if OS.linux?  # clipboard support for Linux

# ------------------------------------------------------------------------------
# macOS Only - Casks
# ------------------------------------------------------------------------------
if OS.mac?
  # Fonts
  cask "font-hackgen-nerd"

  # Terminal
  cask "ghostty"
  cask "wezterm"

  # Development
  cask "visual-studio-code"

  # AI
  cask "claude"  # Claude Desktop (includes Cowork)

  # Productivity
  cask "1password"
  cask "linear-linear"  # Project management
  cask "raycast"

  # Keyboard & Window Management
  cask "karabiner-elements"
  cask "hammerspoon"

  # Media
  cask "vlc"

end

# ------------------------------------------------------------------------------
# Personal packages (skipped with --work flag)
# ------------------------------------------------------------------------------
if OS.mac? && ENV['WORK_MODE'] != 'true'
  cask "orbstack"  # Container management (Docker/Kubernetes)
  cask "spotify"
  cask "discord"
end

# ------------------------------------------------------------------------------
# Optional: Uncomment as needed
# ------------------------------------------------------------------------------

# Database clients
# brew "mysql-client"
# brew "postgresql"

# Cloud CLI
brew "awscli"
brew "vercel-cli"
# brew "azure-cli"
# brew "google-cloud-sdk" if OS.mac?

# Google Workspace
tap "steipete/tap"
brew "steipete/tap/gogcli"  # Google Workspace CLI

# Container tools
# brew "podman"
# brew "kubectl"
# brew "helm"

# Terraform
# brew "terraform"
# brew "terragrunt"

# Languages (prefer mise/uv instead)
# brew "python"
# brew "node"
# brew "go"
# brew "rust"
