# ------------------------------------------------------------------------------
# Brewfile - Homebrew packages for macOS and Linux
# ------------------------------------------------------------------------------
# Usage: brew bundle --file=Brewfile
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# Shell and prompt
brew "zsh"
brew "sheldon"    # zsh plugin manager
brew "starship"

# Git
brew "git"
brew "gh"

# Modern CLI replacements
brew "eza"          # ls replacement
brew "bat"          # cat replacement
brew "fzf"          # fuzzy finder
brew "ripgrep"      # grep replacement
brew "zoxide"       # cd replacement
brew "zellij"       # terminal multiplexer

# Development tools
brew "direnv"
brew "shellcheck"
brew "pre-commit"

# Runtime managers
brew "mise"       # Node.js, etc.
brew "uv"         # Python

# Utilities
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "gnupg"
brew "xsel" if OS.linux?  # clipboard support for Linux

# ------------------------------------------------------------------------------
# macOS Only - Casks
# ------------------------------------------------------------------------------
if OS.mac?
  # Fonts
  cask "font-hackgen-nerd"

  # Terminal
  cask "ghostty"

  # Development
  cask "visual-studio-code"
  cask "zed"

  # AI
  cask "claude"  # Claude Desktop (includes Cowork)

  # Productivity
  cask "1password"
  cask "raycast"

  # Keyboard & Window Management
  cask "karabiner-elements"
  cask "hammerspoon"

  # Media
  cask "vlc"

  # Other
  cask "rancher"
end

# ------------------------------------------------------------------------------
# Personal packages (skipped with --work flag)
# ------------------------------------------------------------------------------
if OS.mac? && ENV['WORK_MODE'] != 'true'
  cask "orbstack"  # Docker/VM alternative
  cask "spotify"
end

# ------------------------------------------------------------------------------
# Optional: Uncomment as needed
# ------------------------------------------------------------------------------

# Database clients
# brew "mysql-client"
# brew "postgresql"

# Cloud CLI
brew "awscli"
brew "vercel-cli"
# brew "azure-cli"
# brew "google-cloud-sdk" if OS.mac?

# Container tools
# brew "docker"
# brew "docker-compose"
# brew "kubectl"
# brew "helm"

# Terraform
# brew "terraform"
# brew "terragrunt"

# Languages (prefer mise/uv instead)
# brew "python"
# brew "node"
# brew "go"
# brew "rust"
